app/controllers/api/friendships_controller.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2  ORDER BY "friendships"."id" ASC LIMIT 1  [["user_id", 5], ["friend_id", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 77]]
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 4], ["user_id", 1], ["created_at", "2015-03-13 15:59:35.351836"], ["updated_at", "2015-03-13 15:59:35.351836"]]
---
    def create

      friendship = Friendship.where({ user_id: current_user.id, friend_id: params[:friend_id] }).first
      if friendship
        friend_id = friendship.friend_id
        user_id = friendship.user_id
        friendship_dup = Friendship.where( "friend_id = #{user_id} AND user_id = #{friend_id}" ).first

        ActiveRecord::Base.transaction do
          Friendship.destroy(friendship)
          Friendship.destroy(friendship_dup)
        end

        render json: {}
      else
        friendship = current_user.friendships.new(friend_id: params[:friend_id])
        friend = friendship.friend
        friendship_dup = friend.friendships.new(friend_id: current_user.id)


        if ActiveRecord::Base.transaction do
            friendship.save