app/controllers/api/posts_controller.rb

    def create
      @post = current_user.posts.new(post_params)

      if @post.save
---
INSERT INTO "posts" ("drink", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["drink", "Irish Whiskey"], ["body", "Yum"], ["user_id", 5], ["created_at", "2015-03-11 15:06:08.224565"], ["updated_at", "2015-03-11 15:06:08.224565"]]

    def update
      @post = current_user.posts.find(params[:id])

      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", 5], ["id", 43]]
UPDATE "posts" SET "drink" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["drink", "kjlk"], ["body", "jkljk"], ["updated_at", "2015-03-11 18:42:28.488508"], ["id", 43]]