app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1 AND "users"."id" = $2  [["user_id", 11], ["id", 11]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (1)
---
    def show
      @user = User.includes(:whiskys, received_suggestions: [:whisky, :user]).find(params[:id])

      users_id = @user.id
      @posts = Post.includes(:user, :toasts, :toasters, :whisky, comments: [:user])
        .where("user_id = (?)", users_id).order(created_at: :desc).page(1).per(5)