app/views/api/users/show.json.jbuilder

  end
  json.current_user_toast post.toasters.include?(@user)
---
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1 AND "users"."id" = $2  [["user_id", 11], ["id", 11]]