app/controllers/friendships_controller.rb

  def create
    friendship = current_user.friendships.new(friend_id: params[:friend_id])
    friend = friendship.friend
    friendship_dup = friend.friendships.new(friend_id: current_user.id)


    if ActiveRecord::Base.transaction do
        friendship.save
---
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 15], ["user_id", 11], ["created_at", "2015-03-13 02:09:29.586891"], ["updated_at", "2015-03-13 02:09:29.586891"]]

  def destroy
    friendship = Friendship.find_by(params[:id])
---
SELECT  "friendships".* FROM "friendships" WHERE (3) LIMIT 1